{
  "ir_version": "1.0",
  "project": "multi-agent-spec",
  "repository": "https://github.com/agentplexus/multi-agent-spec",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["agentplexus"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-01-24",
      "highlights": [
        { "description": "Add namespace support for organizing agents into subdirectories" }
      ],
      "added": [
        { "description": "Optional `namespace` field in agent schema for organizing agents" },
        { "description": "Recursive directory scanning in `LoadAgentsFromDir` - agents in subdirectories get namespace from directory name" },
        { "description": "`LoadAgentsFromDirFlat` function for non-recursive loading (backward compatibility)" },
        { "description": "`LoadAgentFromFile`, `LoadTeamFromFile`, `LoadDeploymentFromFile` loader functions in Go SDK" },
        { "description": "`Namespace` field on Agent struct in Go SDK" },
        { "description": "`AllowedTools` field on Agent struct in Go SDK" },
        { "description": "`QualifiedName()` method on Agent to get `namespace/name` format" },
        { "description": "`ParseQualifiedName()` function to split qualified names" },
        { "description": "`WithNamespace()` builder method on Agent" },
        { "description": "YAML struct tags on all Agent fields" },
        { "description": "Support for `namespace/agent-name` references in team schema (agents, orchestrator, step.agent)" }
      ],
      "documentation": [
        { "description": "README section on nested agent directories with examples" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-17",
      "added": [
        { "description": "Tasks to agent schema with `id`, `description`, `type`, `command`, `pattern`, `file`, `required`, `expected_output`, `human_in_loop` fields", "commit": "3fd7604" },
        { "description": "DAG-aware topological sorting for team reports", "commit": "9c999e2" },
        { "description": "Team status report IR and renderer (NASA-style Go/No-Go validation)", "commit": "579ee6d" }
      ],
      "changed": [
        { "description": "Rename `checks` to `tasks` in report schema for consistency", "commit": "3fd7604" }
      ],
      "documentation": [
        { "description": "specs/ directory structure convention", "commit": "518a2b2" },
        { "description": "Installation section with Go SDK tagging notes", "commit": "70b7f1e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Initial release with platform-agnostic agent definitions and multi-language SDKs" }
      ],
      "added": [
        { "description": "JSON schemas for agent, team, and deployment definitions", "commit": "ff347db" },
        { "description": "Go SDK with model/tool mappings for Claude Code, Kiro CLI, AWS Bedrock, and AgentKit", "commit": "ff347db" },
        { "description": "Python SDK with Pydantic models", "commit": "ff347db" },
        { "description": "TypeScript SDK with Zod schemas", "commit": "ff347db" },
        { "description": "Example stats-agent-team with multi-platform outputs", "commit": "ff347db" }
      ],
      "documentation": [
        { "description": "README with architecture overview, schemas, and usage examples", "commit": "ff347db" },
        { "description": "v0.1.0 release notes", "commit": "eafb9dd" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions CI workflow for Go SDK testing", "commit": "ff347db" },
        { "description": "GitHub Actions lint workflow with golangci-lint", "commit": "ff347db" },
        { "description": "CodeQL security scanning workflow", "commit": "ff347db" },
        { "description": "Dependabot configuration", "commit": "ff347db" }
      ],
      "fixed": [
        { "description": "CI workflows working-directory set to sdk/go", "commit": "df4f739" },
        { "description": "golangci-lint gofmt formatting", "commit": "a179ad7" }
      ]
    }
  ]
}
